<div class="row">
	<div class="col-md-12">
		<div class="card">
			<div class="card-header">
				<div class="badge"><?= $Translate->get_translate_module_phrase('module_page_oferta', '_oferta') ?>
					<span><?= $Translate->get_translate_module_phrase('module_page_oferta', '_oferta_edit') ?> 03.04.2024</span>
				</div>
			</div>
			<div class="card-container">
				<p class="title_offer">Термины</p>
				<ul class="oferta_list">
					<li><b>Ресурс</b> - веб-сайт, предоставляющий информацию, товары и инструменты для пользователей в рамках игровых серверов Counter-Strike 2. Ресурс включает в себя доступ к игровым ресурсам, обновлениям, возможность взаимодействия с другими игроками. </li>
					<li><b>Сайт</b> - <?= ((!empty($_SERVER['HTTPS'])) ? 'https:' : 'http:').$General->arr_general['site'] ?> и его поддомены.</li>
					<li><b>Пользователь</b> - физическое лицо, обладающее необходимой дееспособностью для заключения настоящего Соглашения, которому предоставляется право на использование Платформы в установленных настоящим Соглашением пределах.</li>
					<li><b>Платформа</b> - термин, обозначающий как совокупности, так и по отдельности: Сайт, программное обеспечение, игровой сервис и каждую из Игр, размещенных на Сайте и доступных для использования Пользователями, весь их функционал, а также, компоненты и элементы Сайта, каждого программного обеспечения, игрового сервиса и каждой из Игр, размещенных на Сайте.</li>
					<li><b>Игра</b> - компьютерная онлайн-игра, являющаяся программой для ЭВМ, представляющая собой совокупность данных, команд и порождаемых ею аудиовизуальных отображений, активируемых последовательно для получения Пользователем определенного результата, предусмотренного сценарием Игры (данные и команды), без внесения платы (активированные данные и команды) или после внесения лицензионного платежа (неактивированные данные и команды). Игра также включает в себя игровые сервера, игровой чат, магазин, базы данных и другие ресурсы проекта, имеющие отношение к Игре. Для входа в Игру Пользователь воспроизводит совокупность данных и команд на своей ЭВМ («клиентская часть Игры», если она предусмотрена функционалом), а совокупность иных данных и команд (включая неактивированные) или все данные и команды за исключением клиентской части Игры размещаются проектом на оперируемых ей серверах.</li>
					<li><b>Клиентская часть Игры</b> – программное обеспечение, необходимое Пользователю для участия в Игре, которое самостоятельно устанавливается Пользователем на его персональный компьютер или иное техническое устройство Пользователя, необходимое для использования Игры.</li>
					<li><b>Аккаунт</b> - учетная запись Пользователя, которая содержит данные о Пользователе и предоставляет Пользователю доступ к Платформе, информации о Пользователе, настройкам, игровым ценностям, статистическим показателям и иной подобной информации.</li>
					<li><b>Магазин</b> – раздел Платформы, в котором Пользователь может приобретать Товары.</li>
					<li><b>Товар</b> – материальные вещи реального мира, предлагаемые ресурсом к покупке Пользователям исключительно для личных нужд, не связанных с осуществлением предпринимательской деятельности, ассортимент и характеристики которых представлены в <a href="<?= $General->arr_general['site'] ?>store" target="_blank">магазине</a>.</li>
					<li><b>Поддомен</b> — домен, являющийся частью домена более высокого уровня.</li>
					<li><b>SteamID</b> - уникальный цифровой идентификатор аккаунта <a href="https://steamcommunity.com" target="_blank">Steam</a>. Он может быть представлен разными способами, но чаще всего используется 64-битный идентификатор аккаунта в виде 17 цифр.</li>
				</ul>
				<p class="title_offer">Предмет договора</p>
				<ul class="oferta_list">
					<li>1.1. Настоящий договор оферты (далее - "Договор") представляет собой официальное предложение ресурса <?= $settings_neo['SiteName'] ?> (далее - "Ресурс") к физическому лицу, обладающему необходимой дееспособностью для заключения настоящего Соглашения (далее - "Пользователь"), заключить договор об оказании услуг по предоставлению доступа к платформе (далее - "Платформа"), размещенной на сайте <a href="<?= $General->arr_general['site'] ?>" target="_blank"><?= $_SERVER['HTTP_HOST']; ?></a> и его поддоменах.</li>
					<li>1.2. Путем акцепта настоящего Договора и использования Платформы, Пользователь считается принявшим условия настоящего Договора.</li>
					<li>1.3. Договор является публичным согласно ст. 426 Гражданского кодекса Российской Федерации и является эквивалентом "устного соглашения" и имеет надлежащую юридическую силу.</li>
					<li>1.4. Моментом заключения настоящего Соглашения является момент принятия Пользователем условий Соглашения. Фактическое использование Платформы Пользователем, вход в Игру через сервер Ресурса или использование Платформы иным образом означает принятие Пользователем условий Соглашения и приравнивается к заключению настоящего Соглашения между Пользователем и Ресурсом. Ресурс вправе потребовать у Пользователя подтверждение ознакомления с условиями Соглашения путем проставления соответствующей отметки/галочки, либо иными способами, не противоречащими действующему законодательству РФ.</li>
					<li>1.5. Договор считается заключенным с момента входа пользователя на сервер, сайт или использования товара.</li>
					<li>1.6. В соответствии со ст. 438 Гражданского кодекса Российской Федерации, полным и безоговорочным принятием условий публичного договора является факт осуществления Пользователем платежа на пожертвование Ресурсу.</li>
					<li>1.7. Используя Ресурс, Пользователь выражает свое согласие с данным Лицензионным соглашением, а также обязуется придерживаться <a href="<?= $General->arr_general['site'] ?>help" target="_blank">Правил</a> пользования Ресурсом.</li>
					<li>1.8. Условия Соглашения распространяются на все Игры и сервисы, пока они присутствуют на Платформе и доступны к использованию.</li>
					<li>1.9. Споры и претензии между Пользователем и другими участниками Ресурса (в том числе самим Ресурсом) разрешаются Ресурсом, если спорный вопрос входит в его компетенцию. При невозможности урегулирования внутри Ресурса спор подлежит разрешению в порядке, предусмотренном законами Российской Федерации.</li>
					<li>1.10. Магазин Ресурса является только внутриигровой системой и относится к <a href="<?= $General->arr_general['site'] ?>help" target="_blank">правилам проекта</a></li>
				</ul>
				<p class="title_offer">Описание услуг</p>
				<ul class="oferta_list">
					<li>2.1. Платформа является веб-сайтом, предоставляющим информацию, товары и инструменты для пользователей в рамках игровых серверов Counter-Strike 2. Платформа включает в себя доступ к игровым ресурсам, обновлениям, возможность взаимодействия с другими игроками, а также другие функциональные возможности, предоставляемые Ресурсом.</li>
					<li>2.2. Все принятые денежные средства Пользователя в пользу Ресурса являются добровольным пожертвованием и не подлежат возврату.</li>
					<li>2.3. Пожертвования денежных средств и покупка товара в магазине является только добровольным желанием клиента.</li>
					<li>2.4. Ресурс не несет ответственности за проблемы с переводом средств, связанные с другими сайтами, платёжными системами, а также проблемы, возникшие со стороны и/или по вине пользователя, либо третьих лиц.</li>
				</ul>
				<p class="title_offer">Порядок предоставления услуг</p>
				<ul class="oferta_list">
					<li>3.1. Доступ к Платформе предоставляется Пользователю после создания аккаунта на сайте <?= ((!empty($_SERVER['HTTPS'])) ? 'https:' : 'http:').$General->arr_general['site'] ?> и его поддоменах.</li>
					<li>3.2. Пользователь обязуется использовать Платформу в соответствии с условиями настоящего Договора, а также <a href="<?= $General->arr_general['site'] ?>help" target="_blank">правилами</a> и положениями, опубликованными на сайте Ресурса.</li>
					<li>3.3. В случае нарушения Пользователем действующих правил, Ресурс оставляет за собой право снять привилегии у Пользователя.</li>
				</ul>
				<p class="title_offer">Обязательства сторон</p>
				<ul class="oferta_list">
					<li>4.1. Ресурс обязуется предоставить доступ к Платформе в соответствии с условиями настоящего Договора.</li>
					<li>4.2. Пользователь обязуется использовать Платформу с соблюдением правил и положений, установленных Ресурсом, а также не нарушать права интеллектуальной собственности, права третьих лиц и действующее законодательство.</li>
				</ul>
				<p class="title_offer">Оплата</p>
				<ul class="oferta_list">
					<li>5.1. Пользование Платформой осуществляется безвозмездно, за исключением случаев приобретения товаров в Магазине, описанном на Платформе.</li>
					<li>5.2. Все привилегии, доступные на Ресурсе, являются вознаграждением за безвозмездную помощь Ресурсу.</li>
				</ul>
				<p class="title_offer">Ответственность сторон</p>
				<ul class="oferta_list">
					<li>6.1. Ресурс не несет ответственности за непреднамеренные сбои в работе Платформы, вызванные форс-мажорными обстоятельствами.</li>
					<li>6.2. Пользователь несет ответственность за конфиденциальность своего аккаунта и личной информации, а также за использование Платформы в соответствии с условиями настоящего Договора.</li>
					<li>6.3. Пользоваться Платформой и её функционалом, а также, получать доступ к Игре Пользователь вправе только через свою учетную запись на платформе Steam (оперируемой компанией Valve Corporation и/или ее аффилированными лицами). Ресурс не администрирует такую учетную запись Пользователя и не хранит персональные данные Пользователей, указанные ими при регистрации на платформе Steam.</li>
					<li>6.4. Доступ к Аккаунту Пользователя осуществляется при указании логина и пароля учетную запись на платформе Steam. Связка «логин-пароль» является ключом простой электронной подписи и позволяет считать действия, совершенные Пользователем, совершенными им лично.</li>
					<li>6.5. Незнание правил договора-оферты или правил проекта не освобождает пользователя от ответственности и наказаний.</li>
					<li>6.6. В случае смены IP адреса игровых серверов все купленные пользователем товары переносятся с прежнего сервера на новый в полном объеме и возможно с возмещением ущерба.</li>
					<li>6.7. Перед покупкой товара пользователь обязан ознакомиться с его возможностями в магазине. Если такой информации нет, необходимо узнать у владельца проекта, что данный товар представляет и какие возможности он дает.</li>
					<li>6.8. В случае утери аккаунта Пользователем, получения VAC блокировки или передачи аккаунта Пользователя третьим лицам Ресурс не несет ответственность за услуги и не делает возврат товара или пожертвованных денежных средств.</li>
					<li>6.9. Ресурс имеет полное право лишить Пользователя купленной привилегии, если Пользователь неуважительно относится к Ресурсу, не соблюдает <a href="<?= $General->arr_general['site'] ?>help" target="_blank">правила Ресурса</a> и игнорирует предупреждения.</li>
					<li>6.10. Пользователь обязуется соблюдать представленный договор оферты при пожертвование денежных средств для пополнения баланса в личном кабинете.</li>
					<li>6.11. Ресурс гарантирует конфиденциальность персональных данных Пользователя в соответствии</li>
					<li>6.12. По желанию пользователь может прекратить хранение и обработку всех своих персональных данных путем написания письменного заявления на удаление профиля.</li>
					<li>6.13. При отсутствии активности более 1 календарного года у Пользователя, или при получении блокировки любого типа блокировки на Ресурсе и/или на платформе Steam, Ресурс оставляет за собой право безвозвратно удалить все данные Пользователя (Персональная статистика, активные услуги, личный счет и т.д.).</li>
				</ul>
				<p class="title_offer">Прочие условия</p>
				<ul class="oferta_list">
					<li>7.1. Настоящий Договор вступает в силу с момента акцепта Пользователем и действует до момента его расторжения в соответствии с условиями настоящего Договора.</li>
					<li>7.2. Все споры и разногласия, возникающие между сторонами в ходе исполнения настоящего Договора, разрешаются путем переговоров.</li>
					<li>7.3. Все привилегии привязаны к уникальному идентификатору Пользователя (SteamID в любой форме) и не подлежат: дальнейшему переносу с аккаунта на другой аккаунт, обмену между игроками, смене, возврату, переносу на другой сервер.</li>
					<li>7.4. В случае закрытия Ресурса/игрового сервера, или передачи его другому владельцу, все доступные услуги аннулируются.</li>
					<li>7.5. Регистрируясь на данном Ресурсе, Пользователь официально соглашается на хранение и обработку Ресурсом своих персональных данных как переданных в процессе регистрации, так и размещенных в процессе дальнейшего использования Ресурса.</li>
					<li>7.6. Настоящее Соглашение не является окончательным. Ресурс имеет право вносить изменения в текст настоящего Договора по своему усмотрению в любой момент и без предварительного уведомления Пользователя. Актуальная (действующая) редакция Договора всегда доступна на сайте.</li>
					<li>7.7. Пользователь соглашается и признает, что внесение изменений в Оферту влечёт за собой внесение этих изменений в заключённый уже действующий между Ресурсом и Пользователем Договор, и эти изменения в Договоре вступают в силу с такими изменениями в Оферте.</li>
				</ul>
				<p class="title_offer">Контактная информация</p>
				<ul class="oferta_list">
					<li>8.1. Ресурс: <?= $General->arr_general['full_name'] ?>.</li>
					<li>Email: <?= !empty($settings_neo['ContactEmail']) ? $settings_neo['ContactEmail'] : $Translate->get_translate_phrase('_IsHidden'); ?></li>
				</ul>
			</div>
		</div>
	</div>
</div>