<?php
return [
    'USD' => '$',   // доллар США
    'EUR' => '€',   // евро
    'GBP' => '£',   // фунт стерлингов
    'JPY' => '¥',   // иена
    'CNY' => '¥',   // юань
    'RUB' => '₽',   // рубль
    'UAH' => '₴',   // гривна
    'INR' => '₹',   // рупия
    'KRW' => '₩',   // вона
    'BRL' => 'R$',  // бразильский реал
    'CAD' => 'C$',  // канадский доллар
    'AUD' => 'A$',  // австралийский доллар
    'CHF' => 'CHF', // швейцарский франк
    'MXN' => 'MX$', // мексиканское песо
    'IRR' => '﷼',   // иранский риал
    'TRY' => '₺',   // турецкая лира
];
