<?php

return [
    'enabled_tg' => 0,
    'text_tg' => 'Подпишись на наш Telegram-канал - там выходят новости проекта и часто проводятся розыгрыши.',
    'money_tg' => 0,
    'url_tg' => '',
    'bot_key_tg' => '',
    'bot_id_tg' => '',
    'enabled_ds' => 0,
    'text_ds' => 'Подпишись на наш Discord - там выходят новости проекта, а также можно пообщаться с другими игроками',
    'money_ds' => 0,
    'url_ds' => '',
    'guild_id_ds' => 0,
    'client_id_ds' => '',
    'secret_id_ds' => '',
    'enabled_vk' => 0,
    'text_vk' => 'Подпишись на нашу группу Вконтакте - там публикуются интересные анонсы',
    'money_vk' => 0,
    'url_vk' => '',
];